[
  {
    "page": 1,
    "text": "Probabilităţi și Statistică, Proiect, grupele 242 și 244 2024 - 2025 Remarci: 1. Proiectele se realizează în echipă de 2-4 persoane. Fiecare echipă va desemna un lider care va fi precizat în documentaţie. 2. Liderul echipei va trimite pe adresa andriciucalexandraQyahoo. com până la data de 1 februarie 2025 ora 22:00 o singură arhivă care va conţine fișierele sursă ale proiectului împreună cu documentaţia. 3. Documentaţia este obligatorie și lipsa ei atrage necorectarea proiectului. 4. Documentaţia trebuie să conţină: Numele membrilor echipei Descrierea problemei Aspecte teoretice folosite în rezolvarea problemei care depășesc nivelul cursului Reprezentări grafice și orice altă formă multimedia oportună proiectului Precizări privind pachete software folosite și surse de inspiraţie Codul și comentarea acestuia, precum și a soluţiei prezentate Identificarea unor eventuale dificultăţi în realizarea cerinţelor Probleme care au rămas deschise în urma implementării actuale Concluzii OBS: Documentaţia se dorește o prezentare completă a proiectului astfel încât eval- uarea acestuia să poată fi făcută facil și nu o documentaţie uzuală pentru un produs software. Problem 1. Obiectivul acestui exerciţiu este de a simula un vector aleator (X, X2) repartizat uniform pe discul unitate D(1) (discul de centru (0,0) și de rază 1). Densitatea acestuia este: 1 acu xo (ra 22) = 2 olzi 12). Pentru aceasta, vom folosi două metode. O primă metodă este metoda de simulare prin acceptare și respingere. Această metodă este des utilizată pentru generarea unei v.a. reparti- zate uniform pe o multime oarecare E. Metoda constă în generarea unei v.a. A repartizată uniform. pe o mulțime F 2 E, mai simplă decât E, apoi testăm dacă X se află în E sau nu. În caz afirmativ, păstrăm X, altfel generăm o nouă realizare a lui X pe F. 1. Justificați teoretic că putem simula un vector (cuplu) aleator repartizat uniform pe pătratul |—1, 1]? plecând de la două v.a. independente repartizate uniform pe segmentul [—1,1].",
    "ocr_model": "tesseract_ro"
  },
  {
    "page": 2,
    "text": "2. Prin metoda acceptării și respingerii, simulați N = 1000 de puncte independente repar- tizate uniform pe discul unitate D(1). Reprezentaţi grafic punctele (X;, Y;) din interi- orul discului unitate cu albastru și pe celelalte cu roșu. 3. Calculaţi media aritmetică a distanței care separă cele N puncte de origine. Comparaţi rezultatul cu media teoretică a variabilei corespunzătoare. O a doua metodă de simulare a unui punct (X,Y) repartizat uniform pe D(1) constă în folosirea schimbării de variabilă în coordonate polare: X = Rcos(0) și Y = Rsin(0). 4. Plecând de la densitatea cuplului (X,Y), găsiți densitatea v.a. R și 6. 5. Simulaţi N = 1000 de puncte prin această metodă și ilustrați grafic aceste puncte (inclusiv conturul cercului). Problem 2. Construiţi o aplicație Shiny în care să reprezentaţi grafic funcțiile de repartitie pentru următoarele variabile aleatoare: 1. X,3 + 2X,X2, 9 Ai So X2, unde Xu, Xa... Xa Sa N(0,1), iar n este fizat, n € 2 X,3+2X,X2 5 XS, X2, unde Xa, Xa Xa 5 N(pu0?), cun e Ro >0, iar n este fixat, n e N. 3. X,2 — 5X, 2, Si X, unde Au, X2,... Xa Sa Exp(A), cu A > 0, iar n este fizat, n € 4. X3X +2, X2, Si Xi, unde Xu, Xa, Xa SA Pois(Ă), cu A > 0, iar n este fizat, n € 5. X,5X +4, XX, unde Xu, Xa... Xa Sa Binom(r, p), cu r e N,p € (0,1), îar n este fizat, n e N. Problem 3. Pentru următoarele subpuncte rezolvările trebuie să fie abordate din două per- spective, adică atât dpdv teoretic, cât și prin intermediul simulărilor. Have fun! a) Pe un plan sunt trasate liniile y = n (cun = 0,1, ..) și un ac de lungime 1 este aruncat aleator pe acest plan. Arătaţi că odaia ca acul să întersecteze vreo linie este egală cu 2. b) Planul este sectionat ca mai sus, de liniile y = n (unde n = 0, £1,£2,...), iar pe plan aruncăm o cruce formată prin unirea mijloacelor a două ace perpendiculare, de lungime 1. Notăm cu Z numărul de intersecții ale crucii cu liniile de pe plan. Arătaţi că E[Z/2] = 2, iar Var(Z/2) = 3/2 — 4. Dacă aţi avea de ales între a folosi acul sau crucea (deci unul din acești doi algoritmi aleatori) pentru a estima valoarea lui m, ce ați alege? De ce?",
    "ocr_model": "tesseract_ro"
  },
  {
    "page": 3,
    "text": "cl) d) Consideraţi acum o valoarea d fizată și un plan pe care sunt trasate liniile y = n - d (unde n = 0, £1,£2,...). Un ac de lungime L(< d) este aruncat la întâmplare pe acest plan. Arătaţi că probabilitatea ca acul să intersecteze vreo linie din plan este egală cu 2L rd” Mai departe, fizati acum pozitia acului și considerați un cerc C de diamentru d, centrat în mijlocul acului. Fie A o linie ale cărei direcție și distanță față de centrul lui C sunt independente și uniform, distribuite pe [0,2] și, respectiv, [0, d/2]. Arătati că probabilitatea ca acul să se intersecteze cu linia (aleatoare) A este egală (tot cu, 2, Pe un plan se consideră următorul grid format cu 2 seturi de linii paralele suprapuse: primul set conține linii la distanță di unele de altele, iar al doilea set conţine linii la distanță d» unele de altele și perpendiculare pe cele din primul set. Un ac de lungime L < mind, d) este aruncat la întâmplare pe acest plan. Arătaţi că probabilitatea ca acesta să intersecteze planul este egală cu Loara, În cadrul simulărilor pentru această problemă ce tip de strategie aleatoare a fost imple- mentată: Las Vegas sau Monte Carlo? Justificați sumar și dați un exemplu de algoritm aleator (cu implementare) din cealaltă categorie.",
    "ocr_model": "tesseract_ro"
  }
]